<template>
  <div>
    <button @click="isModalOpen = true">Политика конфиденциальности</button>

    <HeadlessTransitionRoot
      :show="isModalOpen"
      as="template"
    >
      <HeadlessDialog
        as="div"
        class="relative z-50"
        @close="isModalOpen = false"
      >
        <HeadlessTransitionChild
          as="template"
          enter="duration-300 ease-out"
          enter-from="opacity-0"
          enter-to="opacity-100"
          leave="duration-200 ease-in"
          leave-from="opacity-100"
          leave-to="opacity-0"
        >
          <div class="fixed inset-0 bg-black bg-opacity-25">
            <MouseFollower :hide-when-over-el="dialogPanelEl" />
          </div>
        </HeadlessTransitionChild>

        <div class="fixed bottom-0 left-0 top-0 w-screen overflow-y-auto">
          <div class="flex min-h-full items-center justify-center p-4 text-center">
            <HeadlessTransitionChild
              as="template"
              enter="duration-300 ease-out"
              enter-from="opacity-0 scale-95"
              enter-to="opacity-100 scale-100"
              leave="duration-200 ease-in"
              leave-from="opacity-100 scale-100"
              leave-to="opacity-0 scale-95"
            >
              <HeadlessDialogPanel class="w-full max-w-2xl rounded-2xl shadow-xl transition-all">
                <div
                  ref="dialogPanelEl"
                  class="document w-full rounded-2xl bg-whitegray pb-8 text-start"
                >
                  <HeadlessDialogTitle
                    class="mb-4 flex items-start justify-between border-b border-gray pb-4 pt-8 text-xl font-bold"
                  >
                    <span>Политика конфиденциальности в отношении обработки персональных данных</span>
                    <button
                      class="shrink-0"
                      @click="isModalOpen = false"
                    >
                      <IconClose class="h-8" />
                    </button>
                  </HeadlessDialogTitle>
                  <h3>1. Общие положения</h3>
                  <ul>
                    <li>
                      1.1. Настоящий документ «Политика конфиденциальности в отношении обработки персональных данных»
                      (далее – «Политика») разработан в соответствии с пп. 2 ч. 1 ст. 18.1 Федерального закона от
                      27.07.2006 № 152-ФЗ «О персональных данных», Рекомендациями по составлению документа,
                      определяющего политику оператора в отношении обработки Персональных данных, в порядке,
                      установленном Федеральным законом от 27.07.2006 № 152-ФЗ «О персональных данных».
                    </li>
                    <li>
                      1.2. Настоящий документ определяет политику ИП Мохнорылова О.А. (ОГРНИП 323774600540920, ИНН
                      212914098971), ООО «ВКУС И ЛОСОСЬ»
                    </li>
                    <li>
                      (ИНН: 9727030371, КПП: 772701001, ОГРН: 1237700230811, юридический адрес: 117461, г. Москва,
                      вн.тер.г. муниципальный округ Черемушки, ул. Каховка, д. 20А) (далее именуемые по отдельности –
                      «Оператор») в отношении обработки персональных данных, принятых на обработку, порядок и условия
                      осуществления обработки персональных данных физических лиц - пользователей (далее –
                      «Пользователи»), пользующихся сервисами, расположенными на сайте https://vkusilosos.ru (далее по
                      тексту - Интернет- ресурс) и передавшие свои персональные данные для обработки Оператору с
                      использованием и без использования средств автоматизации, устанавливает процедуры, направленные на
                      предотвращение нарушений законодательства Российской Федерации, устранение последствий таких
                      нарушений, связанных с обработкой персональных данных.
                    </li>
                    <li>
                      1.3. Политика разработана с целью обеспечения защиты прав и свобод Пользователей - субъектов
                      персональных данных при обработке их персональных данных, а также с целью установления
                      ответственности должностных лиц Оператора, имеющих доступ к персональным данным субъектов
                      персональных данных, за невыполнение требований и норм, регулирующих обработку персональных
                      данных.
                    </li>
                    <li>1.4. Действие Политики не распространяется на отношения:</li>
                    <li>• возникающие при обработке персональных данных сотрудников Оператора;</li>
                    <li>
                      • на отношения, указанные в п.2 ст.1 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных
                      данных».
                    </li>
                    <li>
                      1.5. Текст Политики доступен Пользователям в сети Интернет по адресу: https://vkusilosos.ru.
                    </li>
                    <li>1.6. Основные понятия, используемые в Политике:</li>
                    <li>
                      1.6.1. персональные данные – любая информация, относящаяся к прямо или косвенно определенному или
                      определяемому физическому лицу (субъекту персональных данных);
                    </li>
                    <li>
                      1.6.2. оператор персональных данных (оператор) - ИП Мохнорылов О.А. (ОГРНИП 323774600540920, ИНН
                      212914098971), ООО «ВКУС И ЛОСОСЬ»
                    </li>
                    <li>
                      (ИНН: 9727030371, КПП: 772701001, ОГРН: 1237700230811, юридический адрес: 117461, г. Москва,
                      вн.тер.г. муниципальный округ Черемушки, ул. Каховка, д. 20А), самостоятельно или совместно с
                      другими лицами организующиее и (или) осуществляющие обработку персональных данных, а также
                      определяющее цели обработки персональных данных, состав персональных данных, подлежащих обработке,
                      действия (операции), совершаемые с персональными данными;
                    </li>
                    <li>
                      1.6.3. обработка персональных данных – любое действие (операция) или совокупность действий
                      (операций) с персональными данными, совершаемых с использованием средств автоматизации или без их
                      использования. Обработка персональных данных включает в себя, в том числе: сбор; запись;
                      систематизацию; накопление; хранение; уточнение (обновление, изменение); извлечение;
                      использование; передачу (распространение, предоставление, доступ); обезличивание; блокирование;
                      удаление; уничтожение.
                    </li>
                    <li>
                      1.6.4. автоматизированная обработка персональных данных – обработка персональных данных с помощью
                      средств вычислительной техники;
                    </li>
                    <li>
                      1.6.5. предоставление персональных данных – действия, направленные на раскрытие персональных
                      данных определенному лицу или определенному кругу лиц;
                    </li>
                    <li>
                      1.6.6. блокирование персональных данных – временное прекращение обработки персональных данных (за
                      исключением случаев, если обработка необходима для уточнения персональных данных);
                    </li>
                    <li>
                      1.6.7. уничтожение персональных данных – действия, в результате которых становится невозможным
                      восстановить содержание персональных данных в информационной системе персональных данных и (или) в
                      результате которых уничтожаются материальные носители персональных данных;
                    </li>
                    <li>
                      1.6.8. обезличивание персональных данных – действия, в результате которых становится невозможным
                      без использования дополнительной информации определить принадлежность персональных данных
                      конкретному субъекту персональных данных;
                    </li>
                    <li>
                      1.6.9. информационная система персональных данных – совокупность содержащихся в базах данных
                      персональных данных и обеспечивающих их обработку информационных технологий и технических средств;
                    </li>
                    <li>
                      1.6.10. трансграничная передача персональных данных – передача персональных данных на территорию
                      иностранного государства органу власти иностранного государства, иностранному физическому лицу или
                      иностранному юридическому лицу.
                    </li>
                  </ul>

                  <h3>2. Информация, получаемая Оператором</h3>
                  <p>В настоящем Пользовательском соглашении используются следующие термины и определения:</p>
                  <ul>
                    <li>
                      2.1. Оператор собирает, получает доступ и использует в определенных Политикой целях персональные
                      данные Пользователя, техническую и иную информацию, связанную с Пользователем.
                    </li>
                    <li>2.2. Оператор осуществляет обработку следующих персональных данных:</li>
                    <li>
                      2.2.1. Под персональными данными Пользователя понимается следующая информация, которую
                      Пользователь предоставляет Оператору при заполнении полей при оформлении заказа и/или регистрации
                      на Интернет- ресурсе:
                    </li>
                    <li>• ФИО Пользователя;</li>
                    <li>• дата рождения Пользователя;</li>
                    <li>• возраст;</li>
                    <li>
                      • контактный телефон Пользователя (а также указанный Пользователем контактный телефон получателя
                      заказа);
                    </li>
                    <li>• адрес Пользователя, по которому осуществляется доставка заказа;</li>
                    <li>• адрес электронной почты;</li>
                    <li>• история заказов Пользователя, включая их содержимое;</li>
                    <li>• пользовательские сообщения, в том числе в службы поддержки и т.д.;</li>
                    <li>• данные опросов;</li>
                    <li>• данные аккаунтов ВКонтакте, Яндекс, Сбербанк;</li>
                    <li>• данные банковских карт.</li>
                    <li>
                      2.3. Под техническими данными понимается следующая информация, которую Оператор получает при
                      использовании Пользователем сервисов Интернет - ресурса:
                    </li>
                    <li>
                      2.3.1. информация о браузере Пользователя (или иной программе, с помощью которой осуществляется
                      доступ к Сервисам), время доступа, адрес запрашиваемой страницы.
                    </li>
                    <li>2.3.2. даты обращений Пользователя;</li>
                    <li>
                      2.3.3. сведения об использовании Пользователем Интернет - ресурса, включая поисковые запросы;
                    </li>
                    <li>
                      2.3.4. сведения об устройстве Пользователя, в том числе модель устройства, вид операционной
                      системы устройства, уникальные идентификаторы устройства, данные о мобильной сети и номер телефона
                      (сведения о сим карте);
                    </li>
                    <li>2.3.5. IP-адрес;</li>
                    <li>2.3.6. Apple ID;</li>
                    <li>
                      2.3.7. данные об аппаратных событиях, в том числе о сбоях и действиях в системе, отчеты об
                      ошибках, а также о настройках, типе и языке браузера, дате и времени запроса и URL перехода;
                    </li>
                    <li>
                      2.3.8. файлы cookie (cookies — служебная информация, посылаемая веб-сервером на компьютер
                      пользователя, для сохранения в браузере. Применяется для сохранения данных, специфичных для
                      данного пользователя, и используемых веб-сервером для различных целей). Пользователь дает согласие
                      на сбор, анализ и использование cookies, в том числе третьими лицами для целей формирования
                      статистики и оптимизации рекламных сообщений. Большинство браузеров изначально настроены на
                      получение файлов cookie, однако Пользователь может сбросить эти настройки и указать, чтобы браузер
                      блокировал все файлы cookie или оповещал об отправке этих файлов. При этом некоторые функции и
                      сервисы не смогут работать должным образом, если отключить файлы cookie.)
                    </li>
                    <li>
                      2.3.9. сведения о местоположении Пользователя, используя различные технологии определения
                      координат (анализ IP-адреса, данные GPS, сервис геолокации и данные сети оператора), в целях
                      определения кратчайшего маршрута до Пользователя.
                    </li>
                    <li>
                      2.4. В случае использования Пользователем при оплате заказа, сделанного на Интернет - ресурсе,
                      банковской карты, Оператор получает доступ к платежной информации Пользователя, а именно к
                      реквизитам банковских счетов, которые Оператор использует только в момент оплаты и не осуществляет
                      их сбор, хранение и обработку.
                    </li>
                    <li>
                      2.5. Оператор не несет ответственности за сведения, предоставленные Пользователями на Интернет -
                      ресурсе в общедоступной форме.
                    </li>
                  </ul>

                  <h3>3. Получение персональных данных. Порядок отзыва согласия на обработку персональных данных.</h3>
                  <ul>
                    <li>3.1. Персональные данные Пользователей получаются Оператором:</li>
                    <li>
                      • путем личной передачи субъектом персональных данных при внесении данных на сайте
                      https://vkusilosos.ru;
                    </li>
                    <li>
                      • иными способами, не противоречащими законодательству РФ и требованиям международного
                      законодательства о защите персональных данных.
                    </li>
                    <li>
                      3.2. Оставляя свои данные на Интернет- ресурсе путем заполнения полей при оформлении заказа и/или
                      регистрации на Интернет- ресурсе, Пользователи подтверждают и признают, что ознакомлены с
                      условиями Политики и выражают свое согласие на обработку их персональных данных согласно условиям
                      Политики без оговорок и ограничений, руководствуясь своей волей и собственными интересами.
                    </li>
                    <li>
                      3.3. Оператор не проверяет достоверность предоставляемой Пользователями информации, дееспособность
                      Пользователей.
                    </li>
                    <li>
                      3.4. Оператор получает и начинает обработку персональных данных Пользователя с момента получения
                      его согласия. Согласие на обработку персональных данных может быть дано Пользователем в любой
                      форме, позволяющей подтвердить факт получения согласия, если иное не установлено федеральным
                      законом: в письменной, устной или иной форме, предусмотренной действующим законодательством, в том
                      числе посредством совершения субъектом персональных данных конклюдентных действий.
                    </li>
                    <li>
                      3.5. Согласие на обработку персональных данных считается предоставленным Пользователем посредством
                      совершения Пользователем данных следующих конклюдентных действий – проставления в соответствующей
                      форме отметки
                    </li>
                    <li>о согласии на обработку персональных данных.</li>
                    <li>
                      3.6. Получение Оператором персональных данных от иных лиц, а равно передача поручения по обработке
                      персональных данных осуществляется на основании договора, содержащего условия о порядке обработки
                      и сохранения конфиденциальности полученных персональных данных.
                    </li>
                    <li>
                      3.7. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных при
                      условии, что подобная процедура не нарушает требований законодательства РФ. В случае отзыва
                      Пользователем согласия на обработку персональных данных Оператор вправе продолжить обработку
                      персональных данных без согласия Пользователя только при наличии оснований, указанных в Законе.
                    </li>
                    <li>
                      3.8. Для отзыва согласия на обработку персональных данных, данного в письменной форме, необходимо
                      подать соответствующее заявление в соответствии с п. 9.1. настоящего соглашения.
                    </li>
                    <li>
                      3.8.2. В случае отзыва Субъектом персональных данных согласия на обработку его персональных данных
                      Оператор должен прекратить их обработку или обеспечить прекращение такой обработки (если обработка
                      осуществляется другим лицом, действующим по поручению Оператора) и в случае, если сохранение
                      персональных данных более не требуется для целей их обработки, уничтожить персональные данные или
                      обеспечить их уничтожение (если обработка персональных данных осуществляется другим лицом,
                      действующим по поручению Оператора) в срок, не превышающий 30 (Тридцати) дней с даты поступления
                      указанного отзыва, если иное не предусмотрено договором, стороной которого, выгодоприобретателем
                      или поручителем по которому является Субъект персональных данных, иным соглашением между
                      Оператором и Субъектом персональных данных, либо если Оператор не вправе осуществлять обработку
                      персональных данных без согласия Субъекта персональных данных на основаниях, предусмотренных
                      Законом или другими федеральными законами.
                    </li>
                  </ul>

                  <h3>4. Цели использования информации, предоставляемой Пользователем.</h3>
                  <ul>
                    <li>4.1. Оператор осуществляет обработку персональных данных Пользователя в следующих целях:</li>
                    <li>
                      4.1.1. оказания услуг и исполнения Оператором обязательств перед Пользователем, возникающих при
                      пользовании Пользователем сервисов Интернет - ресурса;
                    </li>
                    <li>4.1.2. установления и поддержания связи с Пользователем, информирования Пользователя;</li>
                    <li>4.1.3. регистрации и идентификации Пользователя, в том числе при оформлении заказа;</li>
                    <li>
                      4.1.4. улучшения качества обслуживания, клиентского обслуживания, контроля удовлетворенности
                      Пользователей и качества услуг;
                    </li>
                    <li>4.1.5. модернизации Интернет - ресурса, оценки и анализа работы Интернет - ресурса;</li>
                    <li>
                      4.1.6. информирования Субъекта персональных данных об акциях, специальных предложениях, о новых
                      товарах и услугах;
                    </li>
                    <li>
                      4.1.7. направления на адрес электронной почты и мобильный телефон Пользователя сообщений
                      информационного и рекламного характера, в том числе материалов о проводимых мероприятиях и акциях,
                      предоставляемых услугах, проведения розыгрышей и иных;
                    </li>
                    <li>4.1.8. продвижения товаров и услуг;</li>
                    <li>4.1.9. проведения электронных и sms опросов;</li>
                    <li>
                      4.1.10. проведения маркетинговых, статистических и иных исследований на основе обезличенных
                      данных;
                    </li>
                    <li>4.1.11. таргетирования рекламных материалов;</li>
                    <li>
                      4.1.12. поддержания обратной связи с Пользователями, в том числе обработка их запросов и
                      обращений, информирование о работе Интернет - ресурса;
                    </li>
                    <li>4.1.13. исполнения требований российского законодательства.</li>
                    <li>
                      4.1.14. в иных целях в случае, если соответствующие действия Оператора не противоречат
                      действующему законодательству, деятельности Оператора, и на проведение указанной обработки
                      получено согласие Субъекта персональных данных;
                    </li>
                  </ul>

                  <h3>5. Обработка Персональных данных Пользователя</h3>
                  <ul>
                    <li>5.1. Обработка персональных данных Оператором осуществляется следующими способами:</li>
                    <li>5.1.1. неавтоматизированная обработка персональных данных;</li>
                    <li>
                      5.1.2. автоматизированная обработка персональных данных с передачей полученной информации по
                      информационно-телекоммуникационным сетям или без таковой;
                    </li>
                    <li>5.1.3. смешанная обработка персональных данных.</li>
                    <li>
                      5.2. Оператор осуществляет обработку персональных данных Пользователей посредством совершения
                      любого действия (операции) или совокупности действий (операций), совершаемых с использованием
                      средств автоматизации или без использования таких средств, включая следующие: сбор, запись,
                      систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
                      использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование,
                      удаление, уничтожение персональных данных Пользователя в установленных настоящей Политикой целях,
                      согласно действующему законодательству Российской Федерации.
                    </li>
                    <li>
                      5.3. Пользователь дает свое согласие Оператору на обработку персональных данных Пользователя,
                      предоставляемых при использовании Интернет - ресурса, в том числе на передачу таких персональных
                      данных третьим лицам во исполнение соглашений между Оператором и Пользователем. Оператор
                      предоставляет третьим лицам минимальный объем персональных данных, необходимый только для оказания
                      требуемой услуги или проведения необходимой транзакции.
                    </li>
                    <li>
                      5.4. Обработка персональных данных происходит в автоматизированном режиме, за исключением случаев,
                      когда в отношении Пользователя может быть принято решение, затрагивающее его права и интересы
                      и/или имеющее для него юридические последствия. Сотрудники Оператора, осуществляющие в таких
                      случаях обработку персональных данных, обязуются не разглашать персональные данные, ставшие им
                      известными во время такой обработки.
                    </li>
                    <li>
                      5.5. Обработка персональных данных Пользователя производится Оператором с использованием баз
                      данных на территории Российской Федерации.
                    </li>
                  </ul>

                  <h3>6. Принципы обработки персональных данных.</h3>
                  <ul>
                    <li>6.1. При обработке персональных данных Оператор руководствуется следующими принципами:</li>
                    <li>6.1.1. законности и справедливости;</li>
                    <li>
                      6.1.2. своевременности и достоверности получения согласия субъекта персональных данных на
                      обработку персональных данных;
                    </li>
                    <li>6.1.3. обработки только персональных данных, которые отвечают целям их обработки;</li>
                    <li>
                      6.1.4. соответствия содержания и объема обрабатываемых персональных данных заявленным целям
                      обработки. Обрабатываемые персональные данные не должны быть избыточными по отношению к заявленным
                      целям их обработки;
                    </li>
                    <li>
                      6.1.5. недопустимости объединения баз данных, содержащих персональные данные, обработка которых
                      осуществляется в целях, несовместимых между собой;
                    </li>
                    <li>
                      6.1.6. обеспечения точности персональных данных, их достаточности, а в необходимых случаях и
                      актуальности по отношению к целям обработки персональных данных. Оператор принимает необходимые
                      меры либо обеспечивает их принятие по удалению или уточнению неполных или неточных данных;
                    </li>
                    <li>
                      6.1.7. хранения персональных данных в форме, позволяющей определить субъекта персональных данных,
                      не дольше, чем этого требуют цели обработки персональных данных.
                    </li>
                    <li>
                      6.1.8. обеспечения точности, достаточности и актуальности персональных данных по отношению к целям
                      обработки персональных данных;
                    </li>
                    <li>
                      6.1.9. уничтожения либо обезличивания персональных данных по достижению целей, их обработки или в
                      случае утраты необходимости в достижении этих целей.
                    </li>
                    <li>
                      6.2. Обработка персональных данных Оператором осуществляется с соблюдением принципов и правил,
                      предусмотренных:
                    </li>
                    <li>6.2.1. Федеральным законом от 27.07.2006 №152-ФЗ «О персональных данных»;</li>
                    <li>6.2.2. настоящим Положением;</li>
                    <li>6.3. Обработка персональных данных Оператором осуществляется в соответствии с:</li>
                    <li>
                      6.3.1. Постановлением Правительства РФ от 01.11.2012г. № 1119 «Об утверждении требований к защите
                      персональных данных при их обработке в информационных системах персональных данных»;
                    </li>
                    <li>
                      6.3.2. Приказом ФСТЭК России от 18.02.2013г. № 21 «Об утверждении Состава и содержания
                      организационных и технических мер по обеспечению безопасности персональных данных при их обработке
                      в информационных системах персональных данных»;
                    </li>
                    <li>
                      6.3.3. иными нормативными и ненормативными правовыми актами, регулирующими вопросы обработки
                      персональных данных.
                    </li>
                  </ul>

                  <h3>7. Защита предоставляемой Пользователем информации.</h3>
                  <ul>
                    <li>
                      7.1. Оператор принимает необходимые и достаточные правовые, организационные и технические меры для
                      защиты информации Пользователей от неправомерного или случайного доступа, уничтожения, изменения,
                      блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих
                      лиц, путем ограничения доступа к такой информации иных пользователей, сотрудников и партнеров
                      Оператора, третьих лиц (за исключением предоставления Оператором информации, необходимой для
                      исполнения Оператором обязательств перед Пользователем и требований российского законодательства),
                      а также наложения на таких лиц санкций за нарушение режима конфиденциальности в отношении таких
                      данных.
                    </li>
                    <li>
                      7.2. Оператор гарантирует, что предоставленная Пользователями информация не объединяется со
                      статистическими данными, не предоставляется третьим лицам и не разглашается, за исключением
                      случаев, предусмотренных в Политике.
                    </li>
                    <li>
                      7.3. Обработка и передача пользовательских данных выполняется безопасно, с использованием
                      защищенного протокола HTTPS.
                    </li>
                    <li>
                      7.4. При необходимости использования данных Пользователя для целей, не упомянутых в настоящей
                      Политике, Оператор запрашивает предварительное согласие Пользователя.
                    </li>
                    <li>
                      7.5. Настоящая Политика применима к Интернет – ресурсу и персональным данным, которые
                      предоставляет Пользователь в связи с использованием сайта, а также персональных данных, которые
                      Пользователь предоставит Оператору.
                    </li>
                    <li>
                      7.6. Оператор не контролирует и не несет ответственность за информацию третьих лиц, на которые
                      Пользователь может перейти по ссылкам, доступным на Интернет - ресурсе. При переходе по ссылкам, у
                      Пользователя может собираться или запрашиваться иная персональная информация, а также могут
                      совершаться иные действия.
                    </li>
                  </ul>

                  <h3>8. Права Оператора</h3>
                  <ul>
                    <li>
                      8.1. Оператор вправе проводить статистические и иные исследования на основе обезличенной
                      информации, предоставленной Пользователем.
                    </li>
                    <li>
                      8.2. Оператор вправе предоставить информацию о Пользователях правоохранительным органам либо иным
                      государственным органам в рамках судебного процесса или в рамках проведения расследования на
                      основании судебного решения, принудительно исполнимого запроса или в порядке сотрудничества, а
                      также в иных случаях, предусмотренных законодательством РФ.
                    </li>
                    <li>
                      8.3. Оператор вправе предоставить информацию о Пользователях третьим лицам для выявления и
                      пресечения мошеннических действий, для устранения технических неполадок или проблем с
                      безопасностью.
                    </li>
                    <li>
                      8.4. Оператор вправе предоставлять доступ к информации о Пользователе третьим лицам, включая
                      других пользователей, в случае если Пользователь дал на это свое согласие, а также, если такая
                      передача необходима для исполнения Оператором обязательств перед Пользователем.
                    </li>
                    <li>
                      8.5. Оператор вправе предоставить информацию о Пользователях, стратегическим партнерам, которые
                      работают с Продавцом для предоставления продуктов и услуг, или тем из них, которые помогают
                      Продавцу реализовывать продукты и услуги потребителям. Оператор предоставляет третьим лицам
                      минимальный объем персональных данных, необходимый только для оказания требуемой услуги или
                      проведения необходимой транзакции.
                    </li>
                  </ul>

                  <h3>9. Права Пользователя</h3>
                  <ul>
                    <li>
                      9.1. Пользователь вправе в любое время удалить или изменить информацию, предоставляемую им, путем
                      обращения к Оператору, посредством направления соответствующего письменного заявления на
                      электронный адрес: vkusilosos@gmail.com с требованием об уточнении персональных данных, их
                      блокировании или уничтожении. Оператор обязан выполнить данные действия в сроки, установленные ст.
                      21 Федеральным законом от 27.07.2006 N 152-ФЗ «О персональных данных» в срок, не превышающий
                      тридцати дней с даты поступления, заявления. Согласие на получение информационных рассылок и
                      рекламных материалов может быть отозвано Пользователем в любое время путем направления Оператору
                      соответствующего уведомления тем же способом.
                    </li>
                    <li>
                      9.2. Пользователь вправе получить информацию, касающуюся обработки его персональных данных,
                      направив запрос на электронную почту: vkusilosos@gmail.com. Оператор обязан направить ответ в
                      сроки, установленные ст. 20 Федерального закона от 27.07.2006 N 152-ФЗ «О персональных данных».
                      Сведения, которые Оператор обязан предоставить Пользователю, установлены в ч.7 ст. 14 Федерального
                      закона от 27.07.2006 N 152-ФЗ «О персональных данных».
                    </li>
                    <li>
                      9.3. В случае отзыва Пользователем согласия на обработку персональных данных Оператор вправе
                      продолжить обработку данных без согласия субъекта персональных данных при наличии оснований,
                      указанных в пунктах 2 – 11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального
                      закона от 27.07.2006 N 152-ФЗ «О персональных данных».
                    </li>
                  </ul>

                  <h3>10. Ответственность за нарушение или неисполнение.</h3>
                  <ul>
                    <li>
                      10.1. Оператор не несет ответственности за несанкционированное распространение персональных данных
                      в случаях:
                    </li>
                    <li>• если это явилось следствием неосмотрительности пользователя;</li>
                    <li>
                      • если оператор предпринял все зависящие от него меры для обеспечения защиты персональных данных,
                      однако несанкционированный доступ к персональным данным произошел в результате противоправных
                      действий третьих лиц (взлом, атака) или уязвимостей в программном обеспечении.
                    </li>
                    <li>
                      10.2. Во всех остальных случаях ответственность сторон наступает в соответствии с
                      законодательством Российской Федерации.
                    </li>
                  </ul>

                  <h3>11. Изменение Политики. Применимое законодательство.</h3>
                  <ul>
                    <li>
                      11.1. Настоящая Политика может быть изменена или прекращена Оператором в одностороннем порядке без
                      предварительного уведомления Пользователя. Новая редакция Политики вступает в силу с момента ее
                      размещения на сайте, если иное не предусмотрено новой редакцией Политики. Продолжение пользования
                      Сайтом после публикации новой редакции Политики означает принятие Политики и ее условий
                      Пользователем.
                    </li>
                    <li>
                      11.2. В случае несогласия с условиями Политики Пользователь не должен пользоваться сервисами
                      Интернет - ресурса.
                    </li>
                    <li>
                      11.3. К настоящей Политике и отношениям между Пользователем и Оператором, возникающим в связи с
                      применением Политики, подлежит применение законодательство Российской Федерации.
                    </li>
                    <li>
                      11.4. Все отношения, касающиеся обработки персональных данных, не получившие отражения в настоящей
                      Политике, регулируются согласно положениям законодательства РФ
                    </li>
                  </ul>
                </div>
              </HeadlessDialogPanel>
            </HeadlessTransitionChild>
          </div>
        </div>
      </HeadlessDialog>
    </HeadlessTransitionRoot>
  </div>
</template>

<script setup lang="ts">
const dialogPanelEl = ref<HTMLElement>()
const isModalOpen = ref(false)
</script>

<style scoped>
.document > h3 {
  @apply mb-2 text-base font-bold;
}
.document > p {
  @apply mb-4 text-sm;
}

.document > ul {
  @apply mb-8 ml-4 text-sm;
}

.document > ul > li {
  @apply mb-2;
}

.document > * {
  @apply px-8;
}
</style>
