<template>
  <div>
    <button @click="isModalOpen = true">Публичная оферта</button>

    <HeadlessTransitionRoot
      :show="isModalOpen"
      as="template"
    >
      <HeadlessDialog
        as="div"
        class="relative z-50"
        @close="isModalOpen = false"
      >
        <HeadlessTransitionChild
          as="template"
          enter="duration-300 ease-out"
          enter-from="opacity-0"
          enter-to="opacity-100"
          leave="duration-200 ease-in"
          leave-from="opacity-100"
          leave-to="opacity-0"
        >
          <div class="fixed inset-0 bg-black bg-opacity-25">
            <MouseFollower :hide-when-over-el="dialogPanelEl" />
          </div>
        </HeadlessTransitionChild>

        <div class="fixed bottom-0 left-0 top-0 w-screen overflow-y-auto">
          <div class="flex min-h-full items-center justify-center p-4 text-center">
            <HeadlessTransitionChild
              as="template"
              enter="duration-300 ease-out"
              enter-from="opacity-0 scale-95"
              enter-to="opacity-100 scale-100"
              leave="duration-200 ease-in"
              leave-from="opacity-100 scale-100"
              leave-to="opacity-0 scale-95"
            >
              <HeadlessDialogPanel class="w-full max-w-2xl rounded-2xl shadow-xl transition-all">
                <div
                  ref="dialogPanelEl"
                  class="w-full rounded-2xl bg-whitegray document text-start pb-8"
                >
                  <HeadlessDialogTitle class="flex justify-between items-start text-xl font-bold border-b border-gray pt-8 pb-4 mb-4">
                    <span>Публичная оферта</span>
                    <button class="shrink-0" @click="isModalOpen = false"><IconClose class="h-8"/></button>
                  </HeadlessDialogTitle>
                  <h3>1. Термины</h3>
                  <p>
                    В настоящей оферте, если из контекста не следует иное, нижеприведенные термины с заглавной буквы
                    имеют следующие значения.
                  </p>
                  <ul>
                    <li>1.1.	Курьерская служба - лица, оказывающие услуги по доставке Товаров от имени Продавца, или сотрудники Продавца.</li>
                    <li>1.2.	Продавец - юридическое лицо ООО «ВКУС И ЛОСОСЬ» (ИНН: 9727030371 КПП: 772701001 ОГРН: 1237700230811, юридический адрес: 117461, г. Москва, вн.тер.г. муниципальный округ Черемушки, ул. Каховка, д. 20А), созданное в соответствии с законодательством Российской Федерации и осуществляющее предпринимательскую деятельность по продаже Товаров, в том числе дистанционным способом.</li>
                    <li>1.3.	Покупатель - любое дееспособное лицо, намеренное заказать или приобрести, либо заказывающий, приобретающий или использующий Товары исключительно для личных, семейных, домашних или иных нужд, не связанных с осуществлением предпринимательской деятельности.</li>
                    <li>1.4.	Пользователь – лицо, имеющее доступ к Сайту посредством сети Интернет и использующее сервисы, расположенные на сайте, на условиях Пользовательского соглашения.</li>
                    <li>1.5.	Сайт - vkusilosos.ru, а также мобильное приложение, предоставляющие Пользователю возможность заказа товара.</li>
                    <li>1.6.	Телефон - номер телефона, указанный на сайте vkusilosos.ru.</li>
                    <li>1.7.	Товары - перечень продукции Продавца, представленный на Сайте. Потребительские свойства, срок годности Товара указаны на Сайте. Товары могут отличаться от изображения на Сайте.</li>
                  </ul>

                  <h3>2. Общие положения</h3>
                  <ul>
                    <li>2.1.	Продавец и Покупатель гарантируют, что обладают необходимой право- и дееспособностью, а также всеми правами, необходимыми для заключения и исполнения договора розничной купли-продажи дистанционным способом.</li>
                    <li>2.2.	Покупатель обязуется ознакомиться с условиями настоящей оферты, с информацией, указанной на Сайте в отношении Товаров, Политикой Конфиденциальности, Пользовательским соглашением.</li>
                    <li>2.3.	Продавец оставляет за собой право вносить изменения в настоящую оферту, в связи с чем Покупатель обязуется самостоятельно отслеживать наличие изменений в настоящей оферте.</li>
                    <li>2.4.	При оформлении заказа Товаров Покупатель тем самым подтверждает, что он исполнил обязанности, предусмотренные пунктом 2.2. настоящей оферты.</li>
                    <li>2.5.	Договор розничной купли-продажи дистанционным способом считается заключенным с момента получения Продавцом сообщения о намерении Покупателя приобрести Товары.</li>
                  </ul>

                  <h3>3. Уведомления Покупателя</h3>
                  <ul>
                    <li>3.1.	Продавец вправе осуществлять рассылку уведомлений о проводимых акциях и рекламных материалов Пользователю по сетям электросвязи, при условии получения от Пользователя согласия на совершение указанных действий.</li>
                    <li>3.2.	Покупатель имеет право в любой момент отписаться от уведомлений, указанных в пункте 4.1. настоящей оферты, и подписаться на уведомления вновь.</li>
                    <li>3.3.	Продавец вправе совершать вызовы в адрес Покупателей в целях проведения маркетинговых исследований среди Покупателей и исследования предпочтений Покупателей; проведения розыгрышей призов среди Покупателей; проведения анализа оказываемых Продавцом услуг; урегулирования конфликтных ситуаций без получения от Покупателя согласия на совершение всех перечисленных выше действий.</li>
                    <li>3.4.	Продавец вправе отправлять сервисные сообщения, информирующие Покупателя о совершенном им заказе, его составе, этапах его обработки и о готовности заказа; такие сервисные сообщения отправляются автоматически, не могут быть отклонены Покупателем, направлены на контроль качества оказания услуг Покупателю и его информирование о надлежащем исполнении Продавцом своих обязательств по договору купли-продажи дистанционным способом.</li>
                  </ul>

                  <h3>4. Оформление заказа Товаров</h3>
                  <ul>
                    <li>4.1.	Заказ Покупателя может быть оформлен по Телефону и/или посредством заполнения электронной формы заказа на Сайте.</li>
                    <li>4.2.	Покупатель обязуется предоставить достоверные данные, необходимые и достаточные для исполнения договора розничной купли-продажи Товаров дистанционным способом.</li>
                    <li>4.3.	В случае возникновения у Покупателя дополнительных вопросов, касающихся Товаров, перед оформлением Заказа, Покупатель должен обратиться к Продавцу по Телефону для получения необходимой информации, в соответствии с режимом работы, указанным на Сайте.</li>
                    <li>4.4.	Покупатель может заказать только те Товары, которые есть в наличии у Продавца в момент оформления заказа Товаров у Продавца.</li>
                    <li>4.5.	Покупатель не имеет право изменить состав заказа.</li>
                    <li>4.6.	При оформлении заказа по Телефону Продавец вправе осуществлять аудиозапись телефонного разговора с Покупателем, если указанные действия необходимы Продавцу для исполнения обязанностей, предусмотренных настоящей офертой, и оценки качества оказанных услуг, без получения от Покупателя согласия на совершение указанных действий.</li>
                    <li>4.7.	При оформлении заказа посредством заполнения электронной формы заказа на Сайте Покупатель создает учетную запись в соответствии с Пользовательским соглашением, указанным на Сайте.</li>
                    <li>4.8.	Если у Продавца отсутствует необходимое количество или ассортимент заказанных Покупателем Товаров, Продавец информирует об этом Покупателя по телефону в течение 60 минут после получения заказа Товаров от Покупателя. Покупатель вправе согласиться принять Товары в ином количестве или ассортименте, либо аннулировать свой заказ Товаров. в случае неполучения ответа Покупателя Продавец вправе аннулировать Заказ Покупателя в полном объеме.</li>
                    <li>4.9.	Продавец вправе временно приостановить прием заказов Товаров в случае технических неполадок, не позволяющих принять заказа Товаров, или отсутствия ингредиентов, необходимых для изготовления Товаров.</li>
                  </ul>

                  <h3>5. Доставка Товаров</h3>
                  <ul>
                    <li>5.1.	Доставка Товаров осуществляется Курьерской службой по фактическому адресу, указанному Покупателем, при оформлении заказа или выборкой Товаров Покупателем (самовывозом).</li>
                    <li>5.2.	Доставка Товаров в пределах зоны доставки осуществляется в соответствии с режимом работы Продавца, указанным на Сайте.</li>
                    <li>5.3.	Доставка Товаров по адресам, не входящим в зону доставки, не осуществляется.</li>
                    <li>5.4.	Время приготовления и/или Доставки Товара, указанное на Интерне-ресурсе, является приблизительным.</li>
                    <li>5.5.	Доставка осуществляется при условии заказа Товаров на сумму минимального заказа. Сумма минимального заказа определяется Продавцом в одностороннем порядке и указывается на Сайте.</li>
                    <li>5.6.	В случае отсутствия Покупателя по адресу Доставки или невозможности вручения Товара Покупателю по причинам, возникшим по вине Покупателя (Покупатель в течение 10 минут не отвечает на телефонный вызов или не открывает дверь Курьерской службе), а равно как в случае отказа Покупателя от принятия Товара (исключение: Товар ненадлежащего качества или не соответствующего условиям оформленного Покупателем заказа), Покупатель считается отказавшимся от Заказа, при этом денежные средства, уплаченные за Товар и Доставку Покупателем, не подлежат возврату.</li>
                  </ul>

                  <h3>6. Оплата Товаров</h3>
                  <ul>
                    <li>6.1.	Цены на Товары определяются Продавцом в одностороннем порядке и указываются на Сайте. Цена на заказанный Покупателем Товар изменению не подлежит.</li>
                    <li>6.2.	Оплата Товаров Покупателем производится в рублях Российской Федерации одним из следующих способов:</li>
                    <li>6.2.1.	оплата осуществляется по факту получения Товаров наличными денежными средствами;</li>
                    <li>6.2.2.	безналичными расчетами банковской картой на Сайте;</li>
                    <li>6.2.3.	безналичными расчетами банковской картой по факту получения Товаров, при условии оснащения Курьерской службы мобильными POS-терминалами (о наличии возможности произвести оплату Товаров данным способом следует уточнять у Продавца).</li>
                    <li>6.3.	Выдача либо направление Покупателю кассового чека:</li>
                    <li>6.3.1.	На бумажном носителе, в случае совершения заказа Товаров через Телефон и оплаты в порядке, предусмотренном пунктом 7.2.1 настоящей оферты, пунктом 7.2.3 настоящей оферты, если Покупатель в момент совершения заказа не сообщил Продавцу о желании получить кассовый чек в электронном виде, и не выполнил условия, предусмотренные пунктом 7.4.2 настоящей оферты.</li>
                    <li>6.3.2.	В электронном виде на электронную почту Покупателя, в случае совершения заказа Товаров через Сайт и оплаты Товаров в порядке, предусмотренном пунктом 7.2.2 настоящей оферты, если Покупатель выполнил условия пункта 7.4.1. настоящей оферты.</li>
                    <li>6.3.3.	В электронном виде способом, технически доступным для Продавца, в случае совершения заказа Товаров через Сайт и оплаты Товаров в порядке, предусмотренном пунктом 7.2.2 настоящей оферты, если Покупатель не выполнил условия пункта 7.4.1. настоящей оферты.</li>
                    <li>6.4.	Условия направления кассового чека в электронном виде:</li>
                    <li>6.4.1.	Внесение Покупателем данных об адресе электронной почты в личную учетную запись на Сайте при регистрации в порядке, предусмотренном Пользовательским соглашением.</li>
                    <li>6.4.2.	Внесение Покупателем данных об адресе электронной почты в личную учетную запись на Сайте при регистрации в порядке, предусмотренном Пользовательским соглашением, и при условии совершения Покупателем заказа Товаров с номера телефона, который идентичен номеру телефона, внесенному Покупателем в личной учетной записи на Сайте в порядке, предусмотренном Пользовательским соглашением.</li>
                  </ul>

                  <h3>7.	Возврат и обмен Товаров</h3>
                  <ul>
                    <li>7.1.	Покупатель вправе произвести отмену заказа, оформленного на Сайте, в приложении или через оператора call-центра, в течение 5 (пяти) минут с момента отправки Заказа, путем звонка в call-центр по телефону +7 (495)147-29-99. В случае, если заказ был оплачен банковской картой на Сайте или в приложении, стоимость заказа будет возвращена Клиенту на банковскую карту в течение 29 (двадцати девяти) рабочих дней с момента отмены заказа.</li>
                    <li>7.2.	При получении Товаров Покупатель проверяет соответствие полученных Товаров своему заказу, комплектность и отсутствие претензий к внешнему виду доставленных Товаров в течение </li>
                    <li>10 (Десяти) минут после получения Товаров.</li>
                    <li>7.3.	В случае несоответствия полученных Товаров заказанному (отсутствие заявленных ингредиентов </li>
                    <li>в Товаре), Покупатель вправе потребовать замены таких Товаров Товарами надлежащего качества сразу в течение 10 (Десяти) минут после получения Товаров.</li>
                    <li>7.4.	В случае если Клиент обнаружит, что ему передана продукция/товар ненадлежащего качества, он вправе в течение 2 (двух) часов с момента получения заказа и при условии минимального употребления Клиентом продукции/товаров, позволяющего оценить вкусовые качества (остаток продукции/товара к возврату должен быть не менее 90%), возвратить продукцию/товар ненадлежащего качества и потребовать замены продукции/товара либо возврата уплаченной стоимости продукции/товара ненадлежащего качества. При возврате денежных средств или замене продукции/товара Клиент осуществляет возврат первоначальной продукции/товара ненадлежащего качества. Замена продукции/товара ненадлежащего качества производится в ближайшее возможное время, согласованное Клиентом и оператором call-центра. Возврат наличных денежных средств осуществляется одновременно с возвратом продукции/товара ненадлежащего качества, возврат денежных средств при оплате заказа банковской картой производится строго на банковскую карту, использованную для оплаты продукции/товара, в течение 29 (двадцати девяти) рабочих дней </li>
                    <li>с момента возврата продукции/товара ненадлежащего качества.</li>
                    <li>7.5.	Возврат Товара надлежащего качества не допускается.</li>
                  </ul>

                  <h3>8.	Форс-мажор</h3>
                  <ul>
                    <li>8.1.	Любая из Сторон освобождается от ответственности за полное или частичное неисполнение своих обязательств по настоящей оферте, если это неисполнение было вызвано обстоятельствами непреодолимой силы. Обстоятельства непреодолимой силы означают чрезвычайные события и обстоятельства, которые Стороны не могли ни предвидеть, ни предотвратить разумными средствами. Такие чрезвычайные события или обстоятельства включают в себя, в частности: забастовки, наводнения, пожары, землетрясения и иные стихийные бедствия, войны, военные действия и так далее.</li>
                  </ul>

                  <h3>9.	Ответственность Сторон публичной оферты</h3>
                  <ul>
                    <li>9.1.	Продавец не несет ответственности за ущерб, причиненный Покупателю вследствие ненадлежащего использования им Товаров, приобретённых у Продавца.</li>
                    <li>9.2.	Продавец не отвечает за убытки Покупателя, возникшие в результате неправильного заполнения Заказа, в том числе неправильного указания своих данных.</li>
                  </ul>
                </div>
              </HeadlessDialogPanel>
            </HeadlessTransitionChild>
          </div>
        </div>
      </HeadlessDialog>
    </HeadlessTransitionRoot>
  </div>
</template>

<script setup lang="ts">
const dialogPanelEl = ref<HTMLElement>()
const isModalOpen = ref(false)
</script>


<style scoped>

.document > h3 {
  @apply text-base font-bold mb-2
}
.document > p {
  @apply text-sm mb-4
}

.document > ul {
  @apply text-sm mb-8 ml-4
}

.document > ul > li {
  @apply mb-2
}

.document > * {
  @apply px-8
}

</style>