<template>
  <div>
    <button @click="isModalOpen = true">Пользовательское соглашение</button>

    <HeadlessTransitionRoot
      :show="isModalOpen"
      as="template"
    >
      <HeadlessDialog
        as="div"
        class="relative z-50"
        @close="isModalOpen = false"
      >
        <HeadlessTransitionChild
          as="template"
          enter="duration-300 ease-out"
          enter-from="opacity-0"
          enter-to="opacity-100"
          leave="duration-200 ease-in"
          leave-from="opacity-100"
          leave-to="opacity-0"
        >
          <div class="fixed inset-0 bg-black bg-opacity-25">
            <MouseFollower :hide-when-over-el="dialogPanelEl" />
          </div>
        </HeadlessTransitionChild>

        <div class="fixed bottom-0 left-0 top-0 w-screen overflow-y-auto">
          <div class="flex min-h-full items-center justify-center p-4 text-center">
            <HeadlessTransitionChild
              as="template"
              enter="duration-300 ease-out"
              enter-from="opacity-0 scale-95"
              enter-to="opacity-100 scale-100"
              leave="duration-200 ease-in"
              leave-from="opacity-100 scale-100"
              leave-to="opacity-0 scale-95"
            >
              <HeadlessDialogPanel class="w-full max-w-2xl rounded-2xl shadow-xl transition-all">
                <div
                  ref="dialogPanelEl"
                  class="document w-full rounded-2xl bg-whitegray pb-8 text-start"
                >
                  <HeadlessDialogTitle
                    class="mb-4 flex items-start justify-between border-b border-gray pb-4 pt-8 text-xl font-bold"
                  >
                    <span>Пользовательское соглашение</span>
                    <button
                      class="shrink-0"
                      @click="isModalOpen = false"
                    >
                      <IconClose class="h-8" />
                    </button>
                  </HeadlessDialogTitle>
                  <h3>1. Общие положения</h3>
                  <p>
                    В настоящей оферте, если из контекста не следует иное, нижеприведенные термины с заглавной буквы
                    имеют следующие значения.
                  </p>
                  <ul>
                    <li>
                      Настоящее Пользовательское Соглашение регулирует отношения между Администрацией сайта
                      https://vkusilosos.ru и пользователями (далее – «Пользователь», «Пользователи») по использованию
                      сервисов, расположенных на сайте https://vkusilosos.ru (далее – «Интернет- ресурс», «сайт»).
                    </li>
                    <li>
                      1.2. Сайт https://vkusilosos.ru является собственностью ИП Мохнорылова О.А. (ОГРНИП
                      323774600540920, ИНН 212914098971).
                    </li>
                    <li>
                      1.3. Администрация сайта оставляет за собой право в любое время изменять, добавлять или удалять
                      пункты настоящего Пользовательского Соглашения без уведомления Пользователя.
                    </li>
                    <li>
                      1.4. Перед использованием Интернет-ресурса Пользователь обязан ознакомиться с настоящим
                      Пользовательским соглашением и в случае согласия с его положениями присоединиться к нему путем
                      проставления отметки
                    </li>
                    <li>в соответствующей форме.</li>
                    <li>
                      1.5. В случае несогласия Пользователя с положениями настоящего Пользовательского соглашения
                      Пользователь не вправе использовать Интернет-ресурс и/или отдельные его функции.
                    </li>
                    <li>
                      1.6. Пользователь подтверждает, что ознакомился и соглашается с требованиями и положениями
                      настоящего Пользовательского соглашения в полном объеме. Пользуясь Интернет-ресурсом и/или его
                      отдельными функциями, Пользователь считается принявшим Пользовательское соглашение. Стороны
                      приравнивают действия Пользователя, указанные в п. 1.4. настоящего Пользовательского соглашения, к
                      физическому подписанию сторонами настоящего Пользовательского соглашения.
                    </li>
                  </ul>

                  <h3>2. Термины и определения</h3>
                  <p>В настоящем Пользовательском соглашении используются следующие термины и определения:</p>
                  <ul>
                    <li>
                      2.1. Пользователь – лицо, имеющее доступ к Интернет-ресурсу посредством сети Интернет и
                      использующее сервисы, расположенные на сайте, на условиях настоящего Пользовательского соглашения.
                    </li>
                    <li>
                      2.2. Авторизованный пользователь - Пользователь, авторизовавшийся в Интернет- ресурсе с помощью
                      логина и пароля, указанных при регистрации.
                    </li>
                    <li>
                      2.3. Администрация сайта - сотрудники или иные лица, уполномоченные владельцем сайта на управление
                      Интернет- ресурсом.
                    </li>
                    <li>
                      2.4. Сайт, Интернет-ресурс – управляемый Администрацией Интернет-ресурс https://vkusilosos.ru,
                      предоставляющий Пользователю возможность заказа товара.
                    </li>
                    <li>
                      2.5. Заказ – добровольно выбранный и оформленный Пользователем на сайте заказ Товара и/или
                      Доставки на условиях и по цене, определенных и размещенных на Интернет-ресурсе.
                    </li>
                    <li>
                      2.6. Товар – продукция, производимая и реализуемая в сети ресторанов под брэндом «Вкус и Лосось».
                    </li>
                    <li>
                      2.7. Доставка – услуга доставки Товара, выбранная и заказанная Пользователем на условиях,
                      размещенных на Интернет-ресурсе. Администрация сайта без согласия Пользователя вправе привлекать
                      третьих лиц для оказания услуги Доставки.
                    </li>
                    <li>
                      2.8. Самовывоз - самостоятельный вывоз Товара Пользователем или по его поручению иными лицами.
                    </li>
                    <li>
                      2.9. Личный кабинет Пользователя – раздел сайта, содержащий сведения о Пользователе, доступный
                      Пользователю после регистрации и успешной активации в Интернет-ресурсе с использованием логина и
                      пароля, полученных при регистрации, содержащий сведения о ранее принятых, завершенных, отмененных
                      или отклоненных заказах.
                    </li>
                    <li>
                      2.10. Пользовательское соглашение – настоящий документ, размещенный в сети Интернет по адресу:
                      ____________________.
                    </li>
                    <li>
                      2.11. Регулирующие документы - настоящее Пользовательское соглашение, Политика конфиденциальности
                      в отношении обработки персональных данных, Условия использования доставки, а также иные документы,
                      публикуемыми на сайте, в том числе в Мобильном приложении.
                    </li>
                  </ul>

                  <h3>3. Предмет Пользовательского соглашения</h3>
                  <ul>
                    <li>
                      3.1 Настоящее соглашение определяет условия предоставления Пользователю доступа к содержащимся на
                      Сайте Товарам и/или оказываемым услугам.
                    </li>
                    <li>
                      3.2. Настоящее соглашение также регулирует сбор и использование персональных данных пользователей
                      интернет-сайта https://vkusilosos.ru в случае их регистрации на Интернет-ресурсе, пользования
                      услугами сайта, в том числе при оформлении заявки/заказа на сайте.
                    </li>
                    <li>
                      3.3. Пользователь предоставляет персональные данные исключительно по собственной воле.
                      Предоставление пользователем персональных данных означает, что пользователь ознакомлен с настоящим
                      соглашением и соглашается с его условиями.
                    </li>
                    <li>
                      3.4. Соблюдение конфиденциальности относительно персональных данных обеспечивается с момента,
                      когда эти данные были представлены лицом, к которому эти данные относятся.
                    </li>
                    <li>
                      3.5. Персональные данные пользователя не могут быть использованы в целях, противоречащих целям
                      реализации товаров/оказания услуг с помощью Интернет-ресурса. Не допускается использование
                      персональных данных в целях причинения имущественного и (или) морального вреда, ограничения
                      реализации прав и свобод, гарантированных законами Российской Федерации.
                    </li>
                  </ul>

                  <h3>4. Регистрация Пользователя. Права и обязанности.</h3>
                  <ul>
                    <li>4.1. Регистрация Пользователя в личном кабинете является добровольной и бесплатной.</li>
                    <li>
                      4.2. Регистрация Пользователя происходит путем предоставления личных данных и заполнения формы
                      регистрации.
                    </li>
                    <li>
                      4.3. Пользователь выражает свое согласие с условиями Пользовательского соглашения путем
                      проставления отметки в соответствующей форме.
                    </li>
                    <li>
                      4.4. Для завершения процедуры регистрации Пользователь самостоятельно устанавливает и вводит логин
                      и пароль для доступа в Личный кабинет.
                    </li>
                    <li>
                      4.5. Пользователь несет ответственность за достоверность, правильность, актуальность и полноту
                      сведений, предоставленных при регистрации, и ее чистоту от претензий третьих лиц.
                    </li>
                    <li>
                      4.6. Пользователь на используемом им программном обеспечении может разрешить хранение логина и
                      пароля (с использованием файлов cookies) для последующей автоматической авторизации на сайте.
                    </li>
                    <li>4.7. Пользователь обязуется не передавать логин, пароль от личного кабинета третьим лицам.</li>
                    <li>
                      4.8. Пользователь несет ответственность за сохранность и конфиденциальность регистрационных данных
                      (логина и пароля). Все действия, осуществленные через Личный кабинет с использованием логина,
                      номера телефона и пароля Пользователя, в том числе по оплате, считаются осуществленными
                      Пользователем, если Пользователем не доказано обратное.
                    </li>
                    <li>
                      4.9. Пользователь обязан немедленно уведомить Администрацию сайта о любом не несанкционированном
                      доступе к Личному кабинету.
                    </li>
                    <li>
                      4.10. Компания гарантирует Пользователям возможность совершить заказ Товаров и его оплату через
                      Сайт только в случае исправной работы всех коммуникационных сетей и не несет ответственности за
                      неисполнение заказа Товаров в случае технических проблем на Сайте.
                    </li>
                  </ul>

                  <h3>5. Порядок и условия оформления Заказа</h3>
                  <ul>
                    <li>5.1. Оформление заказа на Интернет-ресурсе доступно только Авторизованным.</li>
                    <li>
                      5.2. Пользователь обязуется самостоятельно ознакомиться с Товарами, размещенными на сайте, в том
                      числе с составом, с условиями приготовления, продажи, доставки Товара, стоимостью Товара,
                      стоимостью доставки, а также с любой иной информацией о Товаре, условиях его приобретения, участии
                      в акции, и проч.
                    </li>
                    <li>
                      5.3. Пользователь, ознакомившись с информацией на сайте, а также указанной в п. 5.2. настоящего
                      Пользовательского соглашения, оформляет заказ Товара.
                    </li>
                    <li>
                      5.4. Оформляя заказ, Пользователь подтверждает факт ознакомления и согласия с условиями
                      Пользовательского соглашения, а также факт ознакомления с описанием Товаров, стоимостью Товаров,
                      их составом, условиями приготовления, Доставки, в том числе ее стоимостью и иной информацией,
                      указанной на сайте.
                    </li>
                    <li>
                      5.5. После завершения оформления Заказа, информация о Заказах для Авторизованного пользователя
                      будет доступна в Личном кабинете.
                    </li>
                    <li>
                      5.6. Время приготовления и/или Доставки Товара, указанное на Интерне-ресурсе, является
                      приблизительным.
                    </li>
                    <li>
                      5.7. В рамках проведения различных акций Интернет-ресурсом может быть предусмотрено предоставление
                      подарков, скидок на стоимость Товара и/или Доставки, или иные поощрения Пользователя в период и на
                      условиях проводимой акции.
                    </li>
                    <li>5.8. Пользователь гарантирует и подтверждает, что он:</li>
                    <li>
                      5.8.1. является дееспособным и достиг возраста, позволяющего в соответствии с законодательством РФ
                      заключать договоры, а также совершать иные действия, предусмотренные настоящим Пользовательским
                      соглашением;
                    </li>
                    <li>
                      5.8.2. владеет русским языком на уровне, достаточном для прочтения и осознания смысла и значения
                      Пользовательского соглашения, Политики конфиденциальности в отношении обработки персональных
                      данных, Правил доставки и иных регулирующих документов, размещенных на сайте;
                    </li>
                    <li>
                      5.8.3. прочитал условия Пользовательского соглашения, Политики конфиденциальности в отношении
                      обработки персональных данных, Правил доставки и иных регулирующих документов, понимает их
                      значение и смысл, согласен с их содержанием и обязуется выполнять установленные ими требования, а
                      также понимает все последствия своих действий при использовании сервисов Интерне-ресурса;
                    </li>
                    <li>
                      5.8.4. предоставил Администрации сайта при оформлении заказа и/или регистрации достаточные,
                      действительные и достоверные данные;
                    </li>
                    <li>
                      5.8.5. согласен с обработкой своих персональных данных в соответствии с Пользовательским
                      соглашением, Политикой конфиденциальности в отношении обработки персональных данных и действующим
                      законодательством РФ;
                    </li>
                    <li>
                      5.8.6. согласен на получение сообщений, рассылок информационного и рекламного содержания, в том
                      числе, на получение писем по электронной почте, а также сообщений, связанных с исполнением заказа;
                    </li>
                    <li>
                      Пользователь в любое время вправе отказаться от получения сообщений, рассылок рекламного характера
                      путем направления соответствующего отказа Администрации сайта.
                    </li>
                    <li>
                      5.8.7. понимает и согласен, что в период повышенного спроса сроки подтверждения заказа и его
                      доставки могут быть увеличены;
                    </li>
                    <li>
                      5.8.8. обеспечит принятие и оплату Товара по адресу Доставки, указанному им для получения Заказа.
                    </li>
                    <li>5.8.9. обязуется использовать сервисы Интерне-ресурса только в законных целях.</li>
                  </ul>

                  <h3>6. Персональные данные</h3>
                  <ul>
                    <li>
                      6.1. Политика конфиденциальности в отношении обработки персональных данных определяет политику ИП
                      Мохнорылова О.А. (ОГРНИП 323774600540920, ИНН 212914098971) в отношении обработки персональных
                      данных, принятых на обработку, порядок и условия осуществления обработки персональных данных
                      Пользователей, пользующихся сервисами, расположенными на сайте https://vkusilosos.ru и передавших
                      свои персональные данные для обработки Оператору с использованием и без использования средств
                      автоматизации, устанавливает процедуры, направленные на предотвращение нарушений законодательства
                      Российской Федерации, устранение последствий таких нарушений, связанных с обработкой персональных
                      данных.
                    </li>
                    <li>6.2.Текст Политики доступен Пользователям в сети Интернет по адресу: _______________.</li>
                  </ul>

                  <h3>7. Ответственность</h3>
                  <ul>
                    <li>
                      7.1. На Пользователя возлагается вся ответственность за все последствия, связанные с
                      недостоверностью предоставленной им информации.
                    </li>
                    <li>7.2. Администрация сайта не несет ответственности в случае:</li>
                    <li>
                      7.2.1. Задержки или сбоя в процессе оформления заказа, совершения операции по оплате, которые
                      возникли вследствие непреодолимой силы, а также в иных случаях неполадок в телекоммуникационных,
                      компьютерных, электрических и иных смежных системах.
                    </li>
                    <li>
                      7.2.2. Действия систем переводов, банков, платежных систем и за задержки, связанные с их работой.
                    </li>
                    <li>
                      7.2.3. Корректное функционирование Сайта в случае, если техническое средство Пользователя не
                      соответствует требованиям для его использования, а также не несет никаких обязательств по
                      обеспечению пользователей такими средствами.
                    </li>
                    <li>
                      7.3. Администрация сайта оставляет за собой право отказать Пользователю в использовании услуг
                      Интернет-ресурса, ограничить его доступ в личный кабинет, удалить личный кабинет, заблокировать
                      Пользователя при неоднократном нарушении Пользовательского соглашения, Политики конфиденциальности
                      в отношении обработки персональных данных, Правил доставки и/или иных регулирующих документов, или
                      применить иные меры, по своему усмотрению в рамках действующего законодательства Российской
                      Федерации.
                    </li>
                  </ul>

                  <h3>8. Порядок урегулирования споров</h3>
                  <ul>
                    <li>
                      8.1. Все споры, связанные с заключением, толкованием, исполнением, изменением и настоящего
                      Соглашения, будут разрешаться Сторонами путем переговоров.
                    </li>
                    <li>
                      8.2. В случае не достижения соглашения, заинтересованная Сторона направляет досудебную претензию с
                      предложением о добровольном урегулировании спора в письменной форме, подписанное уполномоченным
                      лицом.
                    </li>
                    <li>
                      8.2.1. К требованию должны быть приложены документы, обосновывающие предъявленные заинтересованной
                      Стороной требования.
                    </li>
                    <li>
                      8.2.2. Требование, направленное без документов, подтверждающих полномочия лица, его подписавшего,
                      считается непредъявленным и рассмотрению не подлежит.
                    </li>
                    <li>
                      8.3. Сторона, которой направлено претензия, обязана ее рассмотреть и о результатах уведомить в
                      письменной форме заинтересованную Сторону в течение 30 календарных дней со дня ее получения.
                    </li>
                    <li>
                      8.4. В случае не урегулирования разногласий в претензионном порядке, а также в случае неполучения
                      ответа на требование в течение указанного срока спор, Сторона вправе обратиться в суд за защитой
                      своих прав, которые предоставлены ей действующим законодательством Российской Федерации.
                    </li>
                    <li>8.5. Все споры и разногласия разрешаются в суде по месту нахождения собственника сайта.</li>
                  </ul>

                  <h3>10. Прочие условия</h3>
                  <ul>
                    <li>
                      10.1. Администрация сайта вправе в одностороннем порядке без предварительного уведомления изменить
                      настоящее Пользовательское соглашение. Новая редакция Соглашения вступает в силу с момента ее
                      опубликования на странице сайта https://vkusilosos.ru, если иное не предусмотрено новой редакцией
                      Соглашения.
                    </li>
                    <li>
                      10.1.1. Риск не ознакомления с новой редакцией Пользовательского соглашения несет Пользователь.
                    </li>
                    <li>
                      10.1.2. Неосуществление Пользователем действий по ознакомлению с новой редакцией Пользовательского
                      соглашения не может служить основанием для неисполнения Пользователем своих обязательств.
                    </li>
                    <li>
                      10.1.3. Продолжение использования сайта после изменения Пользовательского соглашения считается
                      полным и безоговорочным согласием с их новой редакцией.
                    </li>
                    <li>
                      10.1.4. В случае если Пользователь не согласен с изменениями, то он обязан прекратить
                      использование Сервиса.
                    </li>
                    <li>
                      10.2. Недействительность одного или нескольких положений настоящего Соглашения, не влечет
                      недействительность или применимость остальных положений Пользовательского соглашения.
                    </li>
                    <li>
                      10.4. Адрес электронной почты Администрации сайта для рассмотрения обращений Пользователей и иных
                      лиц: vkusilosos@gmail.com.
                    </li>
                  </ul>
                </div>
              </HeadlessDialogPanel>
            </HeadlessTransitionChild>
          </div>
        </div>
      </HeadlessDialog>
    </HeadlessTransitionRoot>
  </div>
</template>

<script setup lang="ts">
const dialogPanelEl = ref<HTMLElement>()
const isModalOpen = ref(false)
</script>

<style scoped>
.document > h3 {
  @apply mb-2 text-base font-bold;
}
.document > p {
  @apply mb-4 text-sm;
}

.document > ul {
  @apply mb-8 ml-4 text-sm;
}

.document > ul > li {
  @apply mb-2;
}

.document > * {
  @apply px-8;
}
</style>
